SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_usart.c
}

/**
*\*\name    USART_Stop_Bits_Config
*\*\fun     Configure the stop bits of the USART.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   stop_bits :
*\*\            - USART_STPB_1
*\*\            - USART_STPB_0_5
*\*\            - USART_STPB_2
*\*\            - USART_STPB_1_5
*\*\return  none
**/
void USART_Stop_Bits_Config(USART_Module* USARTx,uint16_t stop_bits)
{
    uint32_t temp_value   = 0x00;
    temp_value = USARTx->CTRL2;
    /* Clear STOP[13:12] bits */
    temp_value &= CTRL2_STPB_CLR_MASK;
    /* Set STOP[13:12] bits according to stop bits value */
    temp_value |= stop_bits;
    USARTx->CTRL2 = (uint16_t)temp_value;    
}

/**
*\*\name    USART_Parity_Config
*\*\fun     Configure the parity of the USART.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   parity :
*\*\            - USART_PE_NO
*\*\            - USART_PE_EVEN
*\*\            - USART_PE_ODD
*\*\return  none
**/
void USART_Parity_Config(USART_Module* USARTx,uint16_t parity)
{
    uint32_t temp_value   = 0x00; 
    temp_value = USARTx->CTRL1;    
    /* Clear parity[10:9] bits */
    temp_value &= USART_PE_MASK;
    /* Configure the USART parity */
    temp_value |= parity;
    USARTx->CTRL1 = (uint16_t)temp_value;   
}

/**
*\*\name    USART_Mode_Config
*\*\fun     Configure the mode of the USART.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   mode :
*\*\            - USART_MODE_RX
*\*\            - USART_MODE_TX
*\*\return  none
**/
void USART_Mode_Config(USART_Module* USARTx,uint16_t mode)
{
    uint32_t temp_value   = 0x00;   
    temp_value = USARTx->CTRL1;    
    /* Clear mode[3:2] bits */
    temp_value &= USART_MODE_MASK;
    /* Configure the USART parity */
    temp_value |= mode;
    USARTx->CTRL1 = (uint16_t)temp_value; 
}

/**
*\*\name    USART_Hardware_Flow_Control_Config
*\*\fun     Configure the hardware flow control of the USART.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   hardware_flow_control :
*\*\            - USART_HFCTRL_NONE
*\*\            - USART_HFCTRL_RTS
*\*\            - USART_HFCTRL_CTS
*\*\            - USART_HFCTRL_RTS_CTS
*\*\return  none
**/
void USART_Hardware_Flow_Control_Config(USART_Module* USARTx,uint16_t hardware_flow_control)
{
    uint32_t temp_value   = 0x00;  
    temp_value = USARTx->CTRL3;    
    /* Clear hardware_flow_control[9:8] bits */
    temp_value &= USART_HFCTRL_MASK;
    /* Configure the USART hardware_flow_control */
    temp_value |= hardware_flow_control;
    USARTx->CTRL3 = (uint16_t)temp_value; 
}

/**
*\*\name    USART_Structure_Initializes.
*\*\fun     Fills each USART_InitStruct member with its default value.
*\*\param   USART_InitStruct :
*\*\          - BaudRate
*\*\          - WordLength
*\*\          - StopBits
*\*\          - Parity
*\*\          - Mode
*\*\          - HardwareFlowControl
*\*\return  none
**/

void USART_Structure_Initializes(USART_InitType* USART_InitStruct)  
{
    /* USART_InitStruct members default value */
    USART_InitStruct->BaudRate            = 9600;
    USART_InitStruct->WordLength          = USART_WL_8B;
    USART_InitStruct->StopBits            = USART_STPB_1;
    USART_InitStruct->Parity              = USART_PE_NO;
    USART_InitStruct->Mode                = USART_MODE_RX | USART_MODE_TX;
    USART_InitStruct->HardwareFlowControl = USART_HFCTRL_NONE;
}

/**
*\*\name    USART_Clock_Initializes
*\*\fun     Initializes the USARTx peripheral Clock according to the 
            specified parameters in the USART_ClockInitStruct .
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\param   USART_ClockInitStruct :
*\*\          - Clock :
*\*\            - USART_CLK_DISABLE
*\*\            - USART_CLK_ENABLE
*\*\          - Polarity
*\*\            - USART_CLKPOL_LOW
*\*\            - USART_CLKPOL_HIGH
*\*\          - Phase
*\*\            - USART_CLKPHA_1EDGE
*\*\            - USART_CLKPHA_2EDGE
*\*\          - LastBit
*\*\            - USART_CLKLB_DISABLE
*\*\            - USART_CLKLB_ENABLE
*\*\return  none
**/

void USART_Clock_Initializes(USART_Module* USARTx, USART_ClockInitType* USART_ClockInitStruct)
{
    USART_Clock_Config(USARTx,USART_ClockInitStruct->Clock);
    USART_Polarity_Config(USARTx,USART_ClockInitStruct->Polarity);
    USART_Phase_Config(USARTx,USART_ClockInitStruct->Phase);
    USART_Last_Bit_Config(USARTx,USART_ClockInitStruct->LastBit);

}

/**
*\*\name    USART_Clock_Config.
*\*\fun     Enable or disable the USART clock
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\param   clock :
*\*\          - USART_CLK_DISABLE
*\*\          - USART_CLK_ENABLE
*\*\return  none
**/

void USART_Clock_Config(USART_Module* USARTx,uint16_t clock)
{
    uint32_t temp_value = 0x00;
    temp_value = USARTx->CTRL2; 
    /* Clear CLKEN bit */  
    temp_value &= USART_CLK_MASK;   
    /* Set CLKEN bit according to clock value */
    temp_value |= clock;       
    USARTx->CTRL2 = (uint16_t)temp_value; 
}

/**
*\*\name    USART_Polarity_Config.
*\*\fun     Configure USART clock polarity.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\param   polarity :
*\*\          - USART_CLKPOL_LOW
*\*\          - USART_CLKPOL_HIGH
*\*\return  none
**/

void USART_Polarity_Config(USART_Module* USARTx,uint16_t polarity)
{
    uint32_t temp_value = 0x00;
    temp_value = USARTx->CTRL2; 
    /* Clear CLKPOL bit */  
    temp_value &= USART_CLKPOL_MASK;   
    /* Set CLKPOL bit according to clock value */
    temp_value |= polarity;       
    USARTx->CTRL2 = (uint16_t)temp_value; 
}

/**
*\*\name    USART_Phase_Config.
*\*\fun     Configure USART clock phase.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\param   phase :
*\*\          - USART_CLKPHA_1EDGE
*\*\          - USART_CLKPHA_2EDGE
*\*\return  none
**/

