SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_usart.c
void USART_Phase_Config(USART_Module* USARTx,uint16_t phase)
{
    uint32_t temp_value = 0x00;
    temp_value = USARTx->CTRL2; 
    /* Clear CLKPHA bit */  
    temp_value &= USART_CLKPHA_MASK;   
    /* Set CLKPHA bit according to clock value */
    temp_value |= phase;       
    USARTx->CTRL2 = (uint16_t)temp_value; 
}

/**
*\*\name    USART_Last_Bit_Config.
*\*\fun     Configure last bit clock pulse.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\param   last_bit :
*\*\          - USART_CLKLB_DISABLE
*\*\          - USART_CLKLB_ENABLE
*\*\return  none
**/

void USART_Last_Bit_Config(USART_Module* USARTx,uint16_t last_bit)
{
    uint32_t temp_value = 0x00;
    temp_value = USARTx->CTRL2; 
    /* Clear CLKLB bit */  
    temp_value &= USART_CLKLB_MASK;   
    /* Set CLKLB bit according to clock value */
    temp_value |= last_bit;       
    USARTx->CTRL2 = (uint16_t)temp_value; 
}


/**
*\*\name    USART_Initializes_Clock_Structure.
*\*\fun     Fills each USART_ClockInitStruct member with its default value.
*\*\param   USART_ClockInitStruct :
*\*\          - Clock
*\*\          - Polarity
*\*\          - Phase
*\*\          - LastBit
*\*\return  none
**/

void USART_Clock_Structure_Initializes(USART_ClockInitType* USART_ClockInitStruct)
{
    /* USART_ClockInitStruct members default value */
    USART_ClockInitStruct->Clock    = USART_CLK_DISABLE;
    USART_ClockInitStruct->Polarity = USART_CLKPOL_LOW;
    USART_ClockInitStruct->Phase    = USART_CLKPHA_1EDGE;
    USART_ClockInitStruct->LastBit  = USART_CLKLB_DISABLE;
}


/**
*\*\name    USART_Enable.
*\*\fun     Enables the specified USART peripheral.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\return  none
**/
void USART_Enable(USART_Module* USARTx)  
{
    /* Enable the selected USART by setting the UE bit in the CTRL1 register */
    USARTx->CTRL1 |= CTRL1_UEN_SET;
}

/**
*\*\name    USART_Disable.
*\*\fun     Disables the specified USART peripheral.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\return  none
**/
void USART_Disable(USART_Module* USARTx)
{
    /* Disable the selected USART by clearing the UE bit in the CTRL1 register */
    USARTx->CTRL1 &= CTRL1_UEN_RESET;
}

/**
*\*\name    USART_Interrput_Enable.
*\*\fun     Enables the specified USART interrupts.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   USART_interrupt :
*\*\          - USART_INT_PEF
*\*\          - USART_INT_TXDE
*\*\          - USART_INT_TXC
*\*\          - USART_INT_RXDNE
*\*\          - USART_INT_IDLEF
*\*\          - USART_INT_LINBD
*\*\          - USART_INT_CTSF
*\*\          - USART_INT_ERRF
*\*\return  none
**/

void USART_Interrput_Enable(USART_Module* USARTx, uint16_t USART_interrupt)
{
    uint32_t register_value = 0x00, interrupt_position = 0x00, temp_value = 0x00;
    uint32_t base_value = 0x00;

    base_value = (uint32_t)USARTx;

    /* Get the USART register index */
    register_value = (((uint8_t)USART_interrupt) >> USART_CTRL_INDEX_OFFSET);

    /* Get the interrupt position */
    interrupt_position  = USART_interrupt & INT_MASK;
    temp_value = (((uint32_t)0x01) << interrupt_position);

    if (register_value == 0x01) /* The IT is in CTRL1 register */
    {
        base_value += 0x0C;
    }
    else if (register_value == 0x02) /* The IT is in CTRL2 register */
    {
        base_value += 0x10;
    }
    else /* The IT is in CTRL3 register */
    {
        base_value += 0x14;
    }

    *(__IO uint32_t*)base_value |= temp_value;

}

/**
*\*\name    USART_Interrput_Disable.
*\*\fun     Disables the specified USART interrupts.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   USART_interrupt :
*\*\          - USART_INT_PEF
*\*\          - USART_INT_TXDE
*\*\          - USART_INT_TXC
*\*\          - USART_INT_RXDNE
*\*\          - USART_INT_IDLEF
*\*\          - USART_INT_LINBD
*\*\          - USART_INT_CTSF
*\*\          - USART_INT_ERRF
*\*\return  none
**/

void USART_Interrput_Disable(USART_Module* USARTx, uint16_t USART_interrupt)
{
    uint32_t register_value = 0x00, interrupt_position = 0x00, temp_value = 0x00;
    uint32_t base_value = 0x00;
    base_value = (uint32_t)USARTx;

    /* Get the USART register index */
    register_value = (((uint8_t)USART_interrupt) >> USART_CTRL_INDEX_OFFSET);

    /* Get the interrupt position */
    interrupt_position  = USART_interrupt & INT_MASK;
    temp_value = (((uint32_t)0x01) << interrupt_position);

    if (register_value == 0x01) /* The IT is in CTRL1 register */
    {
        base_value += 0x0C;
    }
    else if (register_value == 0x02) /* The IT is in CTRL2 register */
    {
        base_value += 0x10;
    }
    else /* The IT is in CTRL3 register */
    {
        base_value += 0x14;
    }

    *(__IO uint32_t*)base_value &= ~temp_value;

}

/**
*\*\name    USART_DMA_Transfer_Enable.
*\*\fun     Enables the DMA transfer for selected requests.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   USART_DMA_request :
*\*\          - USART_DMAREQ_TX
*\*\          - USART_DMAREQ_RX
*\*\return  none
**/

void USART_DMA_Transfer_Enable(USART_Module* USARTx, uint16_t USART_DMA_request)
{

    /* Enable the DMA transfer for selected requests by setting the DMAT and/or
        DADDR bits in the USART CTRL3 register */
    USARTx->CTRL3 |= USART_DMA_request;

}

/**
*\*\name    USART_DMA_Transfer_Disable.
*\*\fun     Disables the DMA transfer for selected requests.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   USART_DMA_request :
*\*\          - USART_DMAREQ_TX
*\*\          - USART_DMAREQ_RX
*\*\return  none
**/

void USART_DMA_Transfer_Disable(USART_Module* USARTx, uint16_t USART_DMA_request)
{


    /* Disable the DMA transfer for selected requests by clearing the DMAT and/or
        DADDR bits in the USART CTRL3 register */
    USARTx->CTRL3 &= (uint16_t)~USART_DMA_request;

