SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_usart.c
}

/**
*\*\name    USART_Address_Set.
*\*\fun     Sets the address of the USART node.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   USART_address :
*\*\          - (((USART_address)>=0x00)&&((USART_address)<0x10))
*\*\return  none
**/

void USART_Address_Set(USART_Module* USARTx, uint8_t USART_address)
{
    /* Clear the USART address */
    USARTx->CTRL2 &= CTRL2_ADDR_MASK;
    /* Set the USART address node */
    USARTx->CTRL2 |= USART_address;
}

/**
*\*\name    USART_WakeUp_Mode_Set.
*\*\fun     Selects the USART WakeUp method.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   USART_wake_up_mode :
*\*\          - USART_WUM_IDLELINE
*\*\          - USART_WUM_ADDRMASK
*\*\return  none
**/

void USART_WakeUp_Mode_Set(USART_Module* USARTx, uint16_t USART_wake_up_mode)
{

    USARTx->CTRL1 &= CTRL1_WUM_MASK;
    USARTx->CTRL1 |= USART_wake_up_mode;
}

/**
*\*\name    USART_Receiver_Wakeup_Enable.
*\*\fun     Enable the USART mute mode.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\return  none
**/
void USART_Receiver_Wakeup_Enable(USART_Module* USARTx)
{
    /* Enable the USART mute mode  by setting the RWU bit in the CTRL1 register */
    USARTx->CTRL1 |= CTRL1_RCVWU_SET;
}

/**
*\*\name    USART_Receiver_Wakeup_Disable.
*\*\fun     Disable the USART mute mode.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\return  none
**/
void USART_Receiver_Wakeup_Disable(USART_Module* USARTx)
{
    /* Disable the USART mute mode by clearing the RWU bit in the CTRL1 register */
    USARTx->CTRL1 &= CTRL1_RCVWU_RESET;

}

/**
*\*\name    USART_LIN_Break_Detect_Length_Set.
*\*\fun     Sets the USART LIN Break detection length.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   USART_LIN_break_detect_length :
*\*\          - USART_LINBDL_10B
*\*\          - USART_LINBDL_11B
*\*\return  none
**/
void USART_LIN_Break_Detect_Length_Set(USART_Module* USARTx, uint16_t USART_LIN_break_detect_length)
{
    USARTx->CTRL2 &= CTRL2_LINBDL_MASK;
    USARTx->CTRL2 |= USART_LIN_break_detect_length;
}

/**
*\*\name    USART_LIN_Enable.
*\*\fun     Enables the USART's LIN mode.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\return  none
**/
void USART_LIN_Enable(USART_Module* USARTx)
{

    /* Enable the LIN mode by setting the LINEN bit in the CTRL2 register */
    USARTx->CTRL2 |= CTRL2_LINMEN_SET;

}

/**
*\*\name    USART_LIN_Disable.
*\*\fun     Disables the USART's LIN mode.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\return  none
**/
void USART_LIN_Disable(USART_Module* USARTx)
{
    /* Disable the LIN mode by clearing the LINEN bit in the CTRL2 register */
    USARTx->CTRL2 &= CTRL2_LINMEN_RESET;
}

/**
*\*\name    USART_Data_Send.
*\*\fun     Transmits single data through the USARTx peripheral.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   data :
*\*\          - The data to transmit.
*\*\return  none
**/
void USART_Data_Send(USART_Module* USARTx, uint16_t data)
{
    /* Transmit Data */
    USARTx->DAT = (data & (uint16_t)0x01FF);
}

/**
*\*\name    USART_Data_Receive.
*\*\fun     Returns the most recent received data by the USARTx peripheral.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\return  The received data.
**/
uint16_t USART_Data_Receive(USART_Module* USARTx)
{
    /* Receive Data */
    return (uint16_t)(USARTx->DAT & (uint16_t)0x01FF);
}

/**
*\*\name    USART_Break_Frame_Send.
*\*\fun     Transmits break characters.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\return  none
**/
void USART_Break_Frame_Send(USART_Module* USARTx)
{
    /* Send break characters */
    USARTx->CTRL1 |= CTRL1_SDBRK_SET;
}

/**
*\*\name    USART_Guard_Time_Set.
*\*\fun     Sets the specified USART guard time.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\param   USART_guard_time :
*\*\          - Specifies the guard time
*\*\return  none
**/
void USART_Guard_Time_Set(USART_Module* USARTx, uint8_t USART_guard_time)
{
    /* Clear the USART Guard time */
    USARTx->GTP &= GTP_LSB_MASK;
    /* Set the USART guard time */
    USARTx->GTP |= (uint16_t)((uint16_t)USART_guard_time << USART_GTP_GTV_OFFSET);
}

/**
*\*\name    USART_prescaler_Set.
*\*\fun     Sets the system clock prescaler.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\          - UART3
*\*\          - UART4
*\*\param   USART_prescaler :
*\*\          - Specifies the prescaler clock.
*\*\return  none
**/
void USART_Prescaler_Set(USART_Module* USARTx, uint8_t USART_prescaler)
{
    /* Clear the USART prescaler */
    USARTx->GTP &= GTP_MSB_MASK;
    /* Set the USART prescaler */
    USARTx->GTP |= USART_prescaler;
}

/**
*\*\name    USART_Smart_Card_Enable.
*\*\fun     Enables the USART's Smart Card mode.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\return  none
**/

void USART_Smart_Card_Enable(USART_Module* USARTx)
{

    
    /* Enable the SC mode by setting the SCEN bit in the CTRL3 register */
    USARTx->CTRL3 |= CTRL3_SCMEN_SET;

}

/**
*\*\name    USART_Smart_Card_Disable.
*\*\fun     Disables the USART's Smart Card mode.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\return  none
**/

void USART_Smart_Card_Disable(USART_Module* USARTx)
{
    /* Disable the Smart Card mode by clearing the SCEN bit in the CTRL3 register */
    USARTx->CTRL3 &= CTRL3_SCMEN_RESET;
}

/**
*\*\name    USART_Smart_Card_NACK_Enable.
*\*\fun     Enables Smart Card NACK transmission.
*\*\param   USARTx :
*\*\          - USART1
*\*\          - USART2
*\*\return  none
**/
void USART_Smart_Card_NACK_Enable(USART_Module* USARTx)
{

    /* Enable the Smart Card NACK transmission by setting the NACK bit in the CTRL3 register */
    USARTx->CTRL3 |= CTRL3_SCNACK_SET;

